In [1]:
import pandas as pd
import numpy as np
import datetime as dt
from numpy.random import randint

In [2]:
dataToko = []
for num in range(1,11) :
    dataToko.append([num, 
                     'Toko ' + str(num), 
                     'Alamat ' + str(num),
                    randint(1000,10001),
                    dt.datetime(randint(2015,2019),randint(1,13),randint(1,28))])
dataToko

[[1, 'Toko 1', 'Alamat 1', 7395, datetime.datetime(2016, 1, 4, 0, 0)],
 [2, 'Toko 2', 'Alamat 2', 6507, datetime.datetime(2016, 5, 27, 0, 0)],
 [3, 'Toko 3', 'Alamat 3', 2504, datetime.datetime(2016, 8, 7, 0, 0)],
 [4, 'Toko 4', 'Alamat 4', 3965, datetime.datetime(2015, 4, 13, 0, 0)],
 [5, 'Toko 5', 'Alamat 5', 4271, datetime.datetime(2015, 10, 14, 0, 0)],
 [6, 'Toko 6', 'Alamat 6', 7284, datetime.datetime(2018, 6, 21, 0, 0)],
 [7, 'Toko 7', 'Alamat 7', 2680, datetime.datetime(2016, 7, 8, 0, 0)],
 [8, 'Toko 8', 'Alamat 8', 9524, datetime.datetime(2015, 8, 20, 0, 0)],
 [9, 'Toko 9', 'Alamat 9', 7203, datetime.datetime(2017, 4, 12, 0, 0)],
 [10, 'Toko 10', 'Alamat 10', 6149, datetime.datetime(2016, 1, 12, 0, 0)]]

In [3]:
dfToko = pd.DataFrame(data=dataToko, columns=['id','nama','alamat','income','tanggalBerdiri'])
dfToko.head()

   id    nama    alamat  income tanggalBerdiri
0   1  Toko 1  Alamat 1    7395     2016-01-04
1   2  Toko 2  Alamat 2    6507     2016-05-27
2   3  Toko 3  Alamat 3    2504     2016-08-07
3   4  Toko 4  Alamat 4    3965     2015-04-13
4   5  Toko 5  Alamat 5    4271     2015-10-14